Revit 2027 API
FilledRegionType.IsValidSolidFillPatternId Method
 Checks if the id is valid for a background pattern
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSolidFillPatternId(
	ElementId patternId
)
Public Function IsValidSolidFillPatternId (
	patternId As ElementId
) As Boolean
public:
bool IsValidSolidFillPatternId(
	ElementId^ patternId
)
member IsValidSolidFillPatternId :
        patternId : ElementId -> bool
Parameters
patternId ElementId
 Element id of the FillPatternElement
Return Value
Boolean
 False if in a family and the id is a solid fill pattern and 'isMasking' is masking is false. True otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilledRegionType Class
Autodesk.Revit.DB Namespace